src/cf/InformationRegisters/РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнего</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРаспознаваниеДокументов") Тогда
		ВызватьИсключение НСтр("ru = 'Функциональная опция ИспользоватьРаспознаваниеДокументов отключена.'");
	КонецЕсли;
	
	ПараметрыОтправки = РегистрыСведений.РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.ПолучитьПараметры();
	
	ДатаПоследнего = ПараметрыОтправки.ДатаПоследнего;
	НомерСеанса = ПараметрыОтправки.НомерСеанса;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПоследнегоПриИзменении(Элемент)
	
	ПриИзмененииНаСервере(ДатаПоследнего, НомерСеанса);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСеансаПриИзменении(Элемент)
	
	ПриИзмененииНаСервере(ДатаПоследнего, НомерСеанса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПриИзмененииНаСервере(ДатаПоследнего, НомерСеанса)
	
	РегистрыСведений.РаспознаваниеДокументовПоследнийОтправленныйЗамерВремени.ЗаписатьПараметры(
		ДатаПоследнего,
		НомерСеанса
	);
	
КонецПроцедуры

#КонецОбласти
